{
  "@context": [
    "http://schema.org"
  ],
  "@type": [
    "JobPosting"
  ],
  "title": [
    "Lead Data Scientist"
  ],
  "skills": [
    [
      "r"
    ],
    [
      "sql"
    ],
    [
      "python"
    ]
  ],
  "description": [
    "<h2>About this job<\/h2>\r\n<p><span>Compensation: <strong>Equity<\/strong><\/span><br/><span>Location options: <strong>Remote<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Lead, Manager<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Financial Services, Insurance<\/strong><\/span><br/><span>Company size: <strong>201-500 people<\/strong><\/span><br/><span>Company type: <strong>Private<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>r, sql, python<\/p> <br/><br/><h2>Job description<\/h2> <p><strong>About the Position<\/strong> <\/p>\r\n<p>As we build the future of consumer insurance in a modern age, data is at the core of everything that we do. The role requires team members who are adept at using large data sets to find opportunities for optimization and can leverage appropriate models to test the effectiveness of different courses of action. Our team uses a variety of data mining and analysis methods, a variety of data tools, builds and implements models, develops algorithms, and creates simulations. Team members must be very comfortable writing production-ready code to include testing and maintenance infrastructure, and able to put models and analysis into production with no support from engineering (we own our stack end to end). At Assurance, we hire experts in their field, and we give them the independence and trust to build based on their expertise. <\/p>\r\n<p><strong>About You<\/strong> <\/p>\r\n<p>You have a proven ability to drive business results with data-based insights and are comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes. You&rsquo;re capable of getting data for analysis on your own, without reliance on engineering, and you can build professional dashboards as standalone software products and tools. We&rsquo;re growing at a rapid pace, so it&rsquo;s important that you embrace the opportunity to blaze your own trail. You thrive in a fast-paced environment where priorities can shift rapidly as we corner opportunity. You can work independently, with little oversight or guidance. <\/p>\r\n\r\n<p>To be successful in this role, you must possess the following: <\/p>\r\n<ul>\r\n<li>Proficiency in either Python or R, and expertise in SQL. <\/li>\r\n<li>Experience working with AWS or another cloud-based computing platform. <\/li>\r\n<li>Experience and working knowledge of data infrastructure, pipelines, and advanced data manipulation. <\/li>\r\n<li>Experience with BI tools like Tableau or Looker (preferred), or any other industry tool such Qlik, PowerBI, Spotfire, etc.<\/li>\r\n<li>Excellent communication ability &ndash; you can explain your work in a way that anyone on the team can understand, and you can frame problems in a way that ensures the right question is being asked. <\/li>\r\n<li>Business Acumen &ndash; you are always eager to understand how the business works, and more specifically, how your work impacts the business. <\/li>\r\n<li>Enthusiastic yet humble &ndash; you are excited about the work you do, but you are also humble enough to embrace feedback &ndash; you don&rsquo;t need to be the smartest person in the room. <\/li>\r\n<li>Bachelors degree in mathematics, statistics, data science or related field of study.<\/li>\r\n<\/ul>\r\n<p> The following additional experience is desired: <\/p>\r\n<ul>\r\n<li>Experience retraining a model within a few days or updating a model within one day. <\/li>\r\n<li>Capable of performing an in-depth analysis and summarizing findings in one day. <\/li>\r\n<li>Comfortable having conversations with our executive team and non-technical team members to distill down their needs and to deliver actionable insights. <\/li>\r\n<\/ul> <br/><br/>"
  ],
  "datePosted": [
    "2021-09-28"
  ],
  "validThrough": [
    "2022-02-17"
  ],
  "employmentType": [
    "FULL_TIME"
  ],
  "incentiveCompensation": [
    "Provides Equity"
  ],
  "experienceRequirements": [
    "Lead, Manager"
  ],
  "industry": [
    [
      "Financial Services"
    ],
    [
      "Insurance"
    ]
  ],
  "jobBenefits": [
    [
      "Unlimited PTO - Take what you need"
    ],
    [
      "Medical, Dental and Vision Insurance"
    ],
    [
      "Paid parental leave"
    ],
    [
      "401k"
    ],
    [
      "Communiter benefits"
    ],
    [
      "Choice of equipment"
    ]
  ],
  "hiringOrganization": {
    "@type": [
      "Organization"
    ],
    "name": [
      "Assurance"
    ],
    "sameAs": [
      "https://assurance.com"
    ],
    "logo": [
      "https://i.stack.imgur.com/wLEy5.png"
    ],
    "description": [
      "<p><strong>About Assurance<\/strong><\/p>\r\n<p>Assurance offers the best online insurance shopping experience; within minutes a customer can have instantly approved life, health, auto, or home coverage. We&rsquo;ve simplified the online checkout process so that customers can get covered instantly online, and we&rsquo;ve also built an on-demand workforce of licensed insurance agents that can speak with customers who want to talk to an expert, 24x7. Powering all of this is a cloud-first, event-driven, service-oriented-architecture, using the latest software frameworks. We combine our web technology with data science models at every step to make intelligent decisions about how we market to customers, what policies we recommend, and which agents we match to customers. Our mission is to make insurance easier, cheaper, and higher quality, for everyone &ndash; not just the affluent. Our team is humble, driven, and committed to improving the lives of millions. We&rsquo;ve pioneered many new technologies and are proud of many world-first technical achievements. We are the only company to pay commissions to on-demand workers with a real-time payment solution, so money earned is deposited into their bank accounts instantly, every day of the year; and to pay dynamic bonus rewards generated in real-time by machine learning models during phone sales calls. We developed a voice signature technology to enable customers to conveniently sign for their insurance policy over the phone. We built a completely serverless telephony platform that uses dozens of machine learning models to automatically optimize how we place phone calls to customers and connect them with sales agents on the platform. <\/p>\r\n<p>In September 2019, Assurance was acquired by Prudential (NYSE:PRU; $36B market cap) to further the joint mission of improving financial wellness across the world. We are at the forefront of this exciting mission and are looking for experienced software engineers who are excited about the chance to rethink the insurance industry from the ground up in a technology-first manner. <\/p>\r\n<p><strong>Our Offices <\/strong><\/p>\r\n<p>We have 3 engineering offices worldwide in Seattle (headquarters), Toronto and Kathmandu. Each office has many teams of engineers; each team owns a set of software applications and business functionality. We work collaboratively across time zones and geographies, using Slack, Zoom, Github, and email. Engineers in remote offices will typically visit headquarters once or twice per year. <\/p>"
    ]
  },
  "jobLocationType": [
    "TELECOMMUTE"
  ],
  "applicantLocationRequirements": [
    {
      "@type": [
        "Country"
      ],
      "name": [
        "CA"
      ]
    },
    {
      "@type": [
        "Country"
      ],
      "name": [
        "US"
      ]
    }
  ]
}
