{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Data Scientist"],"skills":[["machine-learning"],["r"],["sql"],["hive"],["pandas"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Location options: <strong>Remote<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Mid-Level, Senior<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Travel & Tourism<\/strong><\/span><br/><span>Company size: <strong>201-500 people<\/strong><\/span><br/><span>Company type: <strong>VC Funded<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>machine-learning, r, sql, hive, pandas<\/p> <br/><br/><h2>Job description<\/h2> <p><strong>THE ROLE<\/strong><\/p>\r\n<p>At Hopper, every dataset tells a story. Do you have what it takes to decipher the clues? <a href=\"http://bit.ly/2q6U8dq\" rel=\"nofollow\">bit.ly/2q6U8dq<\/a> We&rsquo;re looking for a data-savvy individual to join our team as a Sr. Data Scientist to drive data-centric product development and revenue growth, as well as lead risk management, for risk-based services which make up 70% of our overall revenue! You may be a great fit for our team if you are excited about exploring huge (and sometimes messy) data sets and finding effective ways to simplify and communicate the results to a non-technical audience.<\/p>\r\n<p><strong>IN THIS ROLE, YOU WILL:<\/strong><\/p>\r\n<ul>\r\n<li>Frame and conduct complex exploratory analyses needed to deepen our understanding of our users. Partner with product, business and strategy teams to contribute to product improvements and initiatives<\/li>\r\n<li>Use machine learning and big data tools on tremendously large and complex data to deepen our data-driven advice and personalized modeling<\/li>\r\n<li>Conduct research into various aspects of our business and employ statistical and modeling techniques when appropriate to make recommendations to non-technical stakeholders<\/li>\r\n<\/ul>\r\n<p><strong>AN IDEAL CANDIDATE HAS:<\/strong><\/p>\r\n<ul>\r\n<li>A degree in Math, Statistics, Computer Science, Engineering or other quantitative disciplines<\/li>\r\n<li>Extremely strong analytical and problem-solving skills<\/li>\r\n<li>Proven ability to communicate complex technical work to a non-technical audience<\/li>\r\n<li>A strong passion for and extensive experience in conducting empirical research and answering hard questions with data<\/li>\r\n<li>Experience with relational databases and SQL, especially Hive<\/li>\r\n<li>Experience working with extremely large data sets<\/li>\r\n<li>Experience in Pandas, R, SAS or other tools appropriate for large scale data preparation and analysis<\/li>\r\n<li>Experience with data mining, machine learning, statistical modeling tools and underlying algorithms<\/li>\r\n<li>Proficiency with Unix/Linux environments<\/li>\r\n<\/ul>\r\n<p><strong>BENEFITS:<\/strong> &bull; Well-funded and proven startup with large ambitions, competitive salary and stock options &bull; Dynamic and entrepreneurial team where pushing limits is everyday business &bull; 100% employer paid medical, dental, vision, disability and life insurance plans &bull; Access to a 401k (US) or Retirement Savings Plan (Canada)<\/p> <br/><br/>"],"datePosted":["2021-10-14"],"validThrough":["2022-02-09"],"employmentType":["FULL_TIME"],"experienceRequirements":["Mid-Level, Senior"],"industry":[["Travel & Tourism"]],"jobBenefits":[["Competitive Salary and Stock Options"],["100% Employer Paid Medical Insurance"],["Parental Leave"],["Dynamic and Entrepreneurial Team"],["Unlimited Vacation Time"]],"hiringOrganization":{"@type":["Organization"],"name":["Hopper"],"sameAs":["http://www.hopper.com"],"logo":["https://i.stack.imgur.com/icAgF.png"],"description":["<p>Hopper's goal has always been to empower travellers. It goes beyond just saving money on flights and hotels (although that's a big part of it). We give our users unprecedented access to big data. We design thoughtful, award-winning mobile products. We offer a seamless experience before, during, and after our users travel. Every part of our business is focused on creating a world where everyone can fly.<\/p>\r\n<p>Hopper learns and builds together. We've hired the most talented engineers, data scientists, marketers, designers, and leaders to accomplish these goals. But there's more work to do. More problems to solve. More travellers to inspire. <strong>And we would love for you to take off with us.<br><br><\/strong>If you thrive in small, focused teams and high-energy environments and believe in the ability of technology to change the world, learn more about our open jobs and apply at <a href=\"https://www.hopper.com/corp/jobs.html\" rel=\"nofollow\">hopper.com/careers<\/a>.<\/p>"]},"jobLocationType":["TELECOMMUTE"],"applicantLocationRequirements":[{"@type":["Country"],"name":["BM"]},{"@type":["Country"],"name":["CA"]},{"@type":["Country"],"name":["GL"]},{"@type":["Country"],"name":["PM"]},{"@type":["Country"],"name":["US"]}]}
