{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Data Scientist, Performance Media"],"skills":[["r"],["python"],["machine-learning"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Compensation: <strong>$140k - 175k<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Senior, Lead<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Advertising Technology, Data & Analytics, Media<\/strong><\/span><br/><span>Company size: <strong>1k-5k people<\/strong><\/span><br/><span>Company type: <strong>Private<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>r, python, machine-learning<\/p> <br/><br/><h2>Job description<\/h2> <p><strong>Director, Data Scientist, Performance Media Group<\/strong><\/p>\r\n<p>Horizon Media&rsquo;s Performance Media Analytics and Product team is seeking a marketing data scientist who can take a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to the agency&rsquo;s Performance Media clients. Through technical implementation, optimization, and key solutions, you will produce innovative and actionable quantitative models and analyses to address the challenges of marketing effectiveness and business growth. Horizon Media&rsquo;s Performance Media Group comprises of all standard buying activation channels (Search, Social, Programmatic, etc.), and the accompanying analytics and product teams create products and services that drive outcomes for their 70+ clients. The data scientist&rsquo;s role is to provide the modeling and validation that undergird those products.<\/p>\r\n\r\n<p><strong>Responsibilities<\/strong><\/p>\r\n<p>&bull; Lead analytics aspects of client engagements in the areas of marketing effectiveness and marketing portfolio management.<\/p>\r\n<p>&bull; Drive innovation, primarily through developing models and customized measurement techniques to be used in SaaS applications.<\/p>\r\n<p>&bull; Help merge marketing mix models, multi-touch attribution, and randomized controlled experiments to inform clients on how to best allocate investment.<\/p>\r\n<p>&bull; Collaborate with clients to build an end-to-end machine learning framework. Engage various stakeholders, assess data readiness. Be able to scale a proof of concept to a larger solution.<\/p>\r\n<p>&bull; Work with client and internal teams to translate data and model results into tactical and strategic insights that are clear, complete, accurate, relevant, understandable and applicable to decision making and needs for varying client audiences. Co-present to and work with clients to integrate recommendations into business processes.<\/p>\r\n<p>&bull; Collaborate with Product/Engineering teams to increase and optimize capabilities, employing methods which create opportunities for scale, proactively helping to drive innovation.<\/p>\r\n<p>&bull; Develop comprehensive understanding of Horizon Media data structures and metrics, advocating for product changes where needed.<\/p>\r\n\r\n<p><strong>Minimum qualifications<\/strong><\/p>\r\n<p>&bull; Bachelor's degree in Statistics, Computer Science, Engineering, or Mathematics, related quantitative discipline, or equivalent practical experience.<\/p>\r\n<p>&bull; 3 years of experience in data science in a professional capacity using statistical modeling, machine learning, forecasting and optimization. A focus on marketing analytics is a plus.<\/p>\r\n<p>&bull; Experience in Python and/or R.<\/p>\r\n<p>&bull; Experience in data management systems.<\/p>\r\n\r\n<p><strong>Preferred qualifications<\/strong><\/p>\r\n<p>&bull; Master&rsquo;s in Statistics, Computer Science, Engineering, or Mathematics.<\/p>\r\n<p>&bull; Experience delivering bespoke analytics to stakeholders (problem scoping/definition, modeling, interpretation, presentation).<\/p>\r\n<p>&bull; Experience with analytic software tools and languages such as SQL, R, TensorFlow, Python, SAS, SPLUS, and Eviews.<\/p>\r\n<p>&bull; Client vertical experience, including retail, financial services/retail banking, insurance telecommunications, automotive and CPG with experience using or deploying digital analytics and measurement solutions.<\/p>\r\n<p>&bull; Knowledge of the statistical algorithms typically used in Marketing Analytics.<\/p>\r\n<p>&bull; Ability to visualize models and results, and debug and troubleshoot code and models.<\/p> <br/><br/>"],"datePosted":["2021-09-18"],"validThrough":["2022-03-31"],"employmentType":["FULL_TIME"],"experienceRequirements":["Senior, Lead"],"industry":[["Advertising Technology"],["Data & Analytics"],["Media"]],"jobBenefits":[["35 PTO Days!"],["16 weeks parental leave!"],["Indoor and outdoor office space!"],["Gym onsite in NY Office"]],"hiringOrganization":{"@type":["Organization"],"name":["Horizon Media "],"sameAs":["http://horizonmedia.com "],"logo":["https://i.stack.imgur.com/lpd7u.png"]},"baseSalary":{"@type":["MonetaryAmount"],"currency":["USD"],"value":{"@type":["QuantitativeValue"],"minValue":[140000],"maxValue":[175000],"unitText":["YEAR"]}},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"],"addressRegion":["NY"],"addressLocality":["New York"],"streetAddress":["75 Varick Street"],"postalCode":["10013"]}}]}
