{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Data Scientist - Corporate Technology"],"skills":[["r"],["machine-learning"],["sql"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Financial Services<\/strong><\/span><br/><span>Company size: <strong>10k+ people<\/strong><\/span><br/><span>Company type: <strong>Public<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>r, machine-learning, sql<\/p> <br/><br/><h2>Job description<\/h2> The Data Scientist is an individual contributor that should be able to apply quantitative, data science and analytical skills to complex problems. He/she should be able to work across teams to design, develop, and evaluate and execute against those data science and analytical solutions with a keen functional understanding of the business problem. He/she will be responsible for data wrangling, data analysis, modeling, including model selection and producing quick applicable modeling solutions.<p>The position will serve as a thought leader including advising on optimal solutions and opining on challenger models. The role works on strategic, highly visible projects firm wide. It is an opportunity to have meaningful impact on a large scale at a leading financial services firm. The role will develop data-centric solutions that move the bottom line for the firm.<p>In Corporate Technology Machine Learning at JPMorgan Chase, our role involves solving challenging business problems through data science and machine learning techniques across all the corporate functions, including Risk, Compliance, Finance, HR, Legal, and Audit.<p>This role requires a wide variety of strengths and capabilities, including:<br> * Advanced degree in analytical field (e.g., Data Science, Computer Science, Engineering, Applied Mathematics, Statistics, Data Analysis, Operations Research)<br> * Extensive practical expertise and work experience with Machine Learning, both supervised and unsupervised. Deep Learning (neural network) experience is preferred<br> * Experience across broad range of modern analytic and data tools, particularly Python/Anaconda and/or R, XGBoost, Tensorflow and/or Keras, Spark, Hive, SQL<br> * Experience working with engineering teams to operationalize Machine Learning models<br> * Excellent problem solving, communications, and teamwork skills<p>Financial service background preferred, but not required<p>JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.<p>We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.<p>Equal Opportunity Employer/Disability/Veterans<\/p> <br/><br/>"],"datePosted":["2021-10-04"],"validThrough":["2021-12-30"],"employmentType":["FULL_TIME"],"industry":[["Financial Services"]],"jobBenefits":[["Healthcare and Insurance Plans"],["Wellness Programs"],["Maternity and Paternity Leave, Adoption Assistance"],["Retirement Savings Programs"],["Paid Time Off"],["Tuition Assistance"],["Access to Arts and Entertainment Program"],["Stock Purchase Plan"],["Charitable Contribution Matching"],["Learning & Development Resources"]],"hiringOrganization":{"@type":["Organization"],"name":["JPMorgan Chase & Co."],"sameAs":["https://www.jpmorganchase.com"],"logo":["https://i.stack.imgur.com/RsT3S.png"]},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"],"addressRegion":["TX"],"addressLocality":["Plano"]}}]}
