{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Senior Data Scientist - Data Foundation"],"skills":[["python"],["sql"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Compensation: <strong>Equity<\/strong><\/span><br/><span>Location options: <strong>Remote, Paid relocation<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Senior<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Media, Music, podcasts<\/strong><\/span><br/><span>Company size: <strong>5k-10k people<\/strong><\/span><br/><span>Company type: <strong>Public<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>python, sql<\/p> <br/><br/><h2>Job description<\/h2> <p>The Platform team creates the technology that enables Spotify to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many disciplines, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers. Join us and help to amplify productivity, quality and innovation across Spotify. We're looking for a Senior Data Scientist to join Spotify's Data Foundations team. In Data Foundations, the solutions we build impact hundreds of Spotify engineers and data scientists, and thousands of daily data processing jobs: ultimately the user experience of hundreds of MILLIONS of users via more data-informed recommendations and user-experience! As a Senior Data Scientist you will help drive a data-first culture across Spotify, working with a hardworking group of engineers and product managers to develop a detailed understanding of our data ecosystem and develop new strategies for measuring and visualising how data works at Spotify. <\/p>\r\n<p><strong>What You' ll do<\/strong><\/p>\r\n<ul>\r\n<ul>\r\n<li>Work closely with a cross-functional, geographically distributed team of data scientists, user researchers, product managers, designers and engineers across New York, Stockholm and London.<\/li>\r\n<li>Define metrics and build and analyze dashboards, reports and key datasets to drive data-informed product development.<\/li>\r\n<li>Apply thorough analysis to understand and detail sophisticated workflows, data flows and processes.<\/li>\r\n<li>Communicate insights and recommendations to key partners, helping to activate data standard methodologies in Data Foundations, and more broadly in the data, insights and engineering communities across all of Spotify.<\/li>\r\n<li>Develop and innovate on our mixed-methods insights practice, and contribute to the wider Insights community at Spotify.<\/li>\r\n<li>Work from our offices in New York (With the current situation regarding COVID-19, this role will be remote until it's appropriate to work from the office).<\/li>\r\n<\/ul>\r\n<\/ul>\r\n<p><strong>Who you are<\/strong><\/p>\r\n<ul>\r\n<ul>\r\n<li>You have significant professional experience, and a degree in statistics, mathematics, computer science, economics or another quantitative subject area.<\/li>\r\n<li>You are a communicative person who values building strong relationships with colleagues and partners and enjoys mentoring and guiding others.<\/li>\r\n<li>You know how to seek loosely defined problems and come up with meaningful answers and impactful insights.<\/li>\r\n<li>You have an understanding of how to instrument products to accurately collect user and system behaviors through data for a wide variety of insight and product development use cases.<\/li>\r\n<li>You have hands-on experience synthesizing insights from data using tools such as Python, R, BigQuery, SQL, Tableau.<\/li>\r\n<\/ul>\r\n<\/ul>\r\n<p>You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what&rsquo;s playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It&rsquo;s in our differences that we will find the power to keep revolutionizing the way the world listens. Spotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world&rsquo;s most popular audio streaming subscription service with a community of more than 345 million users.<\/p> <br/><br/>"],"datePosted":["2021-10-06"],"validThrough":["2022-01-22"],"employmentType":["FULL_TIME"],"incentiveCompensation":["Provides Equity"],"experienceRequirements":["Senior"],"industry":[["Media"],["Music"],["podcasts"]],"jobBenefits":[["Incentive Mix Program"],["Parental Leave"],["Flexible Public Holidays"],["Spotify Premium Subscription"],["Trips & Festivals Around the Globe"],["Access to extensive learning opportunities for personal development"],["Travel insurance and additional support for all business trips"],["Free, confidential counseling sessions with a qualified counselor"]],"hiringOrganization":{"@type":["Organization"],"name":["Spotify"],"sameAs":["http://www.spotifyjobs.com"],"logo":["https://i.stack.imgur.com/nYDzK.png"],"description":["<p>Our mission is to unlock the potential of human creativity&mdash;by giving a million creative artists the opportunity to live off their art and billions of fans the opportunity to enjoy and be inspired by it.<\/p>\r\n<p>Spotify transformed music listening forever when it launched in Sweden in 2008. Discover, manage and share over 50m tracks for free, or upgrade to Spotify Premium to access exclusive features including offline mode, improved sound quality, and an ad-free music listening experience.<\/p>\r\n<p>Today, Spotify is the most popular global audio streaming service with 286m users, including 130m subscribers across 79 markets. We are the largest driver of revenue to the music business today. <\/p>"]},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"]}}]}
