[{"job_title":"Data Scientist","skills":["sql","r","machine-learning"],"description":"About this job \r\n  Job type:  Full-time    Role:  Data Scientist    Industry:  Financial Services    Company size:  10k+ people    Company type:  Public       Technologies   sql, r, machine-learning     Job description  As a Data Scientist, • You will be working with product owners, program managers, developers, business stakeholders, and executives to deeply understand customer problems and priorities. • You will lead cross-functional projects by applying your analysis techniques to create advanced data modeling and discover insights. These insights that will be foundations for strategic decisions and uncover optimization opportunities. • You will dive into various datasets, becoming a subject matter expert on the data generated by and used by our User Experience, Product, Client onboarding, Support, and service teams. Your expertise will be catalyst to growth. • You will be comfortable with big data systems, intimately familiar with machine learning and statistical methods, and experienced in applying these to solve business problems. • You will shepherd models through the internal validation process, participate in overall project design and delivery with QA's other functional teams and end clients. • You will provide support for audits of model development and implementation by both internal and external auditors. What we're looking for: • Postgraduate university degree in the quantitative discipline required (ex. Statistics, Operations Research, Economics, Computer Science, Engineering). Graduate studies, Masters or Ph.D. required. • Extensive knowledge of data analysis, theory, and statistical techniques (such as linear or nonlinear models, logistic regression, machine learning, macroeconomic forecast, decision trees, cluster analysis, neural networks, etc.) • Strong (at least 3 years) Python, Hive, Elastic Search, and SQL programming skills. Skills that will help you in the role: • Analytical skills - Knowledge of data & analytics. Ability to work independently on analytical tasks. • Teamwork - Ability to work with and in cross-functional teams and virtual teams across locations. • Conceptual thinking - Ability to think strategically about analytics and their value to the organization. • Communication-Ability to think quickly & relay information to technical and non-technical audiences. You will share a range of information, reasoning, insights, and recommendations that will drive decisions by our key stakeholder teams, from simple SQL queries to more advanced long-term modeling and strategic analysis. • A strong bias towards delivering results while dealing with ambiguity in fast-paced, dynamic environments. JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management. We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs. Equal Opportunity Employer/Disability/Veterans","state":"NJ","country":"US","employment_type":"FULL_TIME","company_name":"JPMorgan Chase & Co.","company_url":"https://www.jpmorganchase.com"},{"job_title":"Data Scientist, Performance Media","skills":["r","python","machine-learning"],"description":"About this job \r\n  Compensation:  $140k - 175k    Job type:  Full-time    Experience level:  Senior, Lead    Role:  Data Scientist    Industry:  Advertising Technology, Data & Analytics, Media    Company size:  1k-5k people    Company type:  Private       Technologies   r, python, machine-learning     Job description    Director, Data Scientist, Performance Media Group  \r\n Horizon Media&rsquo;s Performance Media Analytics and Product team is seeking a marketing data scientist who can take a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to the agency&rsquo;s Performance Media clients. Through technical implementation, optimization, and key solutions, you will produce innovative and actionable quantitative models and analyses to address the challenges of marketing effectiveness and business growth. Horizon Media&rsquo;s Performance Media Group comprises of all standard buying activation channels (Search, Social, Programmatic, etc.), and the accompanying analytics and product teams create products and services that drive outcomes for their 70+ clients. The data scientist&rsquo;s role is to provide the modeling and validation that undergird those products. \r\n\r\n  Responsibilities  \r\n  Lead analytics aspects of client engagements in the areas of marketing effectiveness and marketing portfolio management. \r\n  Drive innovation, primarily through developing models and customized measurement techniques to be used in SaaS applications. \r\n  Help merge marketing mix models, multi-touch attribution, and randomized controlled experiments to inform clients on how to best allocate investment. \r\n  Collaborate with clients to build an end-to-end machine learning framework. Engage various stakeholders, assess data readiness. Be able to scale a proof of concept to a larger solution. \r\n  Work with client and internal teams to translate data and model results into tactical and strategic insights that are clear, complete, accurate, relevant, understandable and applicable to decision making and needs for varying client audiences. Co-present to and work with clients to integrate recommendations into business processes. \r\n  Collaborate with Product/Engineering teams to increase and optimize capabilities, employing methods which create opportunities for scale, proactively helping to drive innovation. \r\n  Develop comprehensive understanding of Horizon Media data structures and metrics, advocating for product changes where needed. \r\n\r\n  Minimum qualifications  \r\n  Bachelor's degree in Statistics, Computer Science, Engineering, or Mathematics, related quantitative discipline, or equivalent practical experience. \r\n  3 years of experience in data science in a professional capacity using statistical modeling, machine learning, forecasting and optimization. A focus on marketing analytics is a plus. \r\n  Experience in Python and/or R. \r\n  Experience in data management systems. \r\n\r\n  Preferred qualifications  \r\n  Master&rsquo;s in Statistics, Computer Science, Engineering, or Mathematics. \r\n  Experience delivering bespoke analytics to stakeholders (problem scoping/definition, modeling, interpretation, presentation). \r\n  Experience with analytic software tools and languages such as SQL, R, TensorFlow, Python, SAS, SPLUS, and Eviews. \r\n  Client vertical experience, including retail, financial services/retail banking, insurance telecommunications, automotive and CPG with experience using or deploying digital analytics and measurement solutions. \r\n  Knowledge of the statistical algorithms typically used in Marketing Analytics. \r\n  Ability to visualize models and results, and debug and troubleshoot code and models.","state":"NY","country":"US","employment_type":"FULL_TIME","company_name":"Horizon Media ","company_url":"http://horizonmedia.com ","min_salary":140000,"max_salary":175000},{"job_title":"Senior Data Science Engineer","skills":["machine-learning","r","python"],"description":"About this job \r\n  Job type:  Full-time    Role:  Data Scientist    Industry:  Financial Services    Company size:  10k+ people    Company type:  Public       Technologies   machine-learning, r, python     Job description  As an experienced member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally. We are seeking a Senior Data Science Engineer with strong analytical and statistical skills to use advanced analytics and modeling / machine learning skills to lead the GIAM Data Science Function and transform traditional access management practices by leveraging data science. The candidate will need a combination of business focus, strong analytical and problem solving skills and programming knowledge to be able to cycle through data, propose and implement a new solution. In this role, you will have an excellent career path and numerous opportunities for both personal and professional development in an intellectually stimulating environment. Responsibilities include:  * Collaborate across Identity and Access Management, as well as other data science groups, to deliver data driven insights, recommendations, and solutions that solve important business problems  * Lead Data Science Initiatives and drive the research and development of high quality machine learning models and services to deliver these insights and solutions  * Manage the relationship with internal clients, gathering requirements, understanding business domain, presenting results, and developing a trusted adviser relationship  * Operate across a wide range of ML approaches, including unsupervised, supervised, and reinforcement learning, for tasks including natural language processing (NLP), data anomaly detection, classification, graph analysis, pattern detection, leveraging methods including tree ensembles, neural networks, and clustering techniques  * Provide thought leadership, subject matter expertise and serve as trusted advisor in the analytics discipline  * Manage full lifecycle of data science projects and solutions - including ideation, data acquisition / exploration/ engineering, prototyping, and productionization  * Partner with the Identity and Access Management Data Platform team on in the creation of capabilities which accelerate data science delivery  * Work independently and collaboratively (as needed) within the team to achieve the desired outcomes of an data science efforts This role requires a wide variety of strengths and capabilities, including:  * BS/BA degree or equivalent experience  * Expertise in application, data, and infrastructure architecture disciplines  * Advanced knowledge of architecture and design across all systems  * Proficiency in multiple modern programming languages  * Knowledge of industry-wide technology trends and best practices  * Keen understanding of financial control and budget management  * Ability to work in large, collaborative teams to achieve organizational goals  * Passionate about building an innovative culture  * M.S. or Ph.D. in Statistics, Engineering, Computer Science, Mathematics, Economics or related quantitative field preferred  * Extensive hands on experience in data mining, machine learning, predictive modeling in a large-scale, corporate environment  * Solid coding skills in Python and SQL required; experience with R, SAS, Splunk or other equivalent languages in different environments preferred  * Deep knowledge in Machine Learning, Data Mining, Information Retrieval  * Major machine learning frameworks, including Anaconda and Tensorflow  * Excellent analytical and critical thinking skills  * Self-starter with great skills in teamwork, partnership, and communications both verbal and written  * Experience delivering Data Science capabilities on a cloud platform (ex: AWS, Azure, Google)  * Knowledge of Identity and Access Domain is a plus JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management. We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs. Equal Opportunity Employer/Disability/Veterans","state":"NJ","country":"US","employment_type":"FULL_TIME","company_name":"JPMorgan Chase & Co.","company_url":"https://www.jpmorganchase.com"},{"job_title":"Global Technology - VP, Data Scientist Lead - Applied AI","skills":["machine-learning","r","python"],"description":"About this job \r\n  Job type:  Full-time    Role:  Data Scientist    Industry:  Financial Services    Company size:  10k+ people    Company type:  Public       Technologies   machine-learning, r, python     Job description  JPMorgan Chase & Co. is a leading global financial services firm, established over 200 years ago. We are the leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. Inside the firm we are an ever evolving landscape of data infrastructure and data technologies to mine diamonds out of our coal mines. GTI Applied AI mission is to provide business value by solving complex, big scale and high impact problems. The team applies AI to solve open ended problems that align state of the art AI solutions with enterprise scale challenges. In doing so, the team build software systems, AI models, technological process and intelligent frameworks that minimize the technological risk, increase operational efficiency and increase the investment efficacy in general. In this particular instance, we are looking for a Senior Data Scientist to join the team whose mission is to combine advanced analytical and quantitative techniques with technological business acumen to solve serve the technological portfolio of solutions. As a Data Scientist Lead, you will be responsible for leading and end to end initiative that could entail an analytical feature of a bigger product, an AI product by itself or running proof of concepts for the team (PoC). These tasks are accomplished by modeling complex problems, discovering insights, manipulating terabytes of data, building cutting edge hybrid AI products that solve high impact and big scale problems through statistical modeling, machine learning, visualization and story telling that increases the operational value of our technological portfolio. You will need to be able to provide guidance to more junior members of the team in terms of collaboration, processes and standards of contribution. At the same time, cross-functional collaboration is essential for the success in this role, since a full integrated end to end solution is the expected deliverable. The effective candidate should be able to communicate effectively to a broader audience and also be prepared to build relationships with senior non-technical stakeholders. This is a high visible and high impact role where the contribution is effective to the strategy of the portfolio. Basic Qualifications:  * Generally 6+ of related experience.  * Bachelor's degree in a quantitative or related field; Advanced degree preferred.  * Knowledge of statistical software packages and message based data tools (SAS, Python, SQL and R)  * Extensive experience in Applied Modeling from varying domain knowledges. Ideally, with strong hypothesis testing and insight discovery mindset.  * Extensive experience with hands on statistical modeling / analytical modelling software.  * Significant experience leading end to end AI features embedded into an enterprise product.  * Expertise as a generalist and specialization in one of the following machine learning and statistical learning frameworks such as: classification, regression, time series, collaborative filtering, clustering, feature engineering, natural language processing, etc.  * Demonstrable experience in data structure, data mining and data analysis techniques with real world data. Preferred Qualifications:  * Extensive Industry experience in applied modeling and analytical problem solving.  * Extensive Industry experience with Streaming and Big Data analytical modeling.  * Significant experience leading highly quantitative teams within an agile methodology.  * Experience in leading R&D efforts within enterprise environments.  * Experience in technological domain knowledges.  * Demonstrable communication and storytelling techniques to drive influence across non-technical audiences. JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management. We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs. Equal Opportunity Employer/Disability/Veterans","state":"NJ","country":"US","employment_type":"FULL_TIME","company_name":"JPMorgan Chase & Co.","company_url":"https://www.jpmorganchase.com"},{"job_title":"Data Scientist, Machine Learning Evaluation","skills":["python","sql","machine-learning","pandas","amazon-web-services"],"description":"About this job \r\n  Job type:  Full-time    Experience level:  Mid-Level, Senior, Lead    Role:  Data Scientist    Industry:  Artificial Intelligence, Computer Software, Machine Learning    Company size:  51-200 people    Company type:  Public       Technologies   python, sql, machine-learning, pandas, amazon-web-services     Job description   We are currently looking for a talented data scientist to work with technology, engineering, and other data scientists to define success of machine learning software and help establish our ML evaluation team at McD Tech Labs. You will be tasked with defining how we evaluate quality of our machine learning algorithms and models that operate with petabyte-scale worth of customer interaction data. What evaluation data sets make sense? How do we craft and curate such data sets? What data mining techniques and systems are necessary to identify such data across diverse regions and stores worldwide? \r\n The ideal candidate will have previous experience using advanced analytics techniques and creating ML models to tackle diverse and large-scale ML data challenges. \r\n Responsibilities: \r\n \r\n \r\n Work with teams of data scientists in the ML evaluation work of our AI Drive Through Product \r\n \r\n \r\n Collaborate with technology, engineering, and other data science team leaders to define success of machine learning software development lifecycle. \r\n \r\n \r\n Create and own overall ML model and system evaluation datasets, methodology, process and frameworks \r\n \r\n \r\n Craft test cases and regressions suites for ML models operating at petabyte scale. \r\n \r\n \r\n Employ data mining and statistical techniques to tackle diverse and large-scale ML data challenges. \r\n \r\n \r\n \r\n \r\n Provide cross-functional teams and leadership with regular updates and strategic guidance regarding ML model quality through evaluation test framework \r\n \r\n \r\n Qualifications: \r\n \r\n \r\n Master&rsquo;s or PhD Degree in Information Technology, Computer Science, or a related quantitative field \r\n \r\n \r\n \r\n \r\n Minimum of 5 years of experience in data science with proven experience leading a team of Data Scientists \r\n \r\n \r\n 3+ years of Python experience working with big-data \r\n \r\n \r\n Strong understanding of high-performance algorithms, and data mining \r\n \r\n \r\n Experience in developing state-of-the-art data science techniques for large-scale machine learning products \r\n \r\n \r\n Strong understanding of ML data pipelines, from defining, collecting to crafting ground truth and training/testing data sets for ML models \r\n \r\n \r\n \r\n \r\n Demonstrated ability to facilitate and coordinate complex data design and development activities across teams in agile sprints with minimal direction \r\n \r\n \r\n Qualifications: \r\n \r\n \r\n Master&rsquo;s or PhD Degree in Information Technology, Computer Science, or a related quantitative field \r\n \r\n \r\n \r\n \r\n Minimum of 5 years of experience in data science with proven experience leading a team of Data Scientists \r\n \r\n \r\n 3+ years of Python experience working with big-data","state":"CA","country":"US","employment_type":"FULL_TIME","company_name":"McD Tech Labs"},{"job_title":"Lead Data Scientist","skills":["python","nlp","machine-learning","bigdata","apache-spark"],"description":"About this job \r\n  Compensation:  £100k - 120k | Equity    Location options:  Remote, Visa sponsor, Paid relocation    Job type:  Full-time    Experience level:  Lead    Role:  Data Scientist    Industry:  Cybersecurity, Machine Learning, Security Software    Company size:  51-200 people    Company type:  VC Funded       Technologies   python, nlp, machine-learning, bigdata, apache-spark     Job description    Data Science at Tessian  \r\n Our mission is to secure the human layer. This involves deploying near real-time machine learning models at massive scale to some of the world&rsquo;s largest organisations to keep their most sensitive data private and secure. To do this, we're looking for a senior data scientist with NLP experience ready to work on hard problems, drive best practice and cultivate an environment of experimentation and learning. Companies can leverage data science in a number of ways, and we think the role of a Data Scientist falls into three distinct categories: \r\n 1) You work for a business function analysing &amp; reporting on how to improve a key metric, e.g increasing user conversion \r\n 2) You are responsible for writing production models to enhance the main product, e.g recommendation systems for e-commerce \r\n 3)  You are the product  - without machine learning, it wouldn't exist \r\n The Data Science team built the product at Tessian. We couldn't exist without our machine learning models; it&rsquo;s at the heart of what we do, and it&rsquo;s what our clients rely on day-to-day. We're searching for a Lead NLP Data Scientist who is excited about the opportunities and challenges that come with researching, building and deploying real-time production models. In this role you'll get to: \r\n \r\n Work across massive enterprise email datasets \r\n Defining and driving roadmap for technical excellence in Data Science at Tessian \r\n Deploy models to production that impacts directly our customers and products \r\n Improve our ML workflow \r\n Collaborate with engineering and product leaders to develop a product suite that is continually detecting more advanced threats for our customers \r\n Make your mark on leading ambitious projects \r\n Mentor and knowledge share with data scientists at Tessian \r\n \r\n We'd love to meet someone who: \r\n \r\n Has 6+ years Data Science experience \r\n Has experience leading Team at DS Product focus company \r\n Has strong NLP experience (in production) \r\n Has worked with, or understands the principles behind working with data at scale \r\n Can balance longer term projects alongside impactful quick wins \r\n Cares deeply about the impact their team hasIs a creative at heart, and can encourage novel ways of thinking in their team. This has always been a core part of the data science team&rsquo;s DNA \r\n Reads  Rules of Machine Learning - Martin Zinkevich  and it resonates with how they think about machine learning and data science","state":"NULL","country":"GB","employment_type":"FULL_TIME","company_name":"Tessian","company_url":"http://www.tessian.com","min_salary":100000,"max_salary":120000},{"job_title":"Data Scientist - Corporate Technology","skills":["r","machine-learning","sql"],"description":"About this job \r\n  Job type:  Full-time    Role:  Data Scientist    Industry:  Financial Services    Company size:  10k+ people    Company type:  Public       Technologies   r, machine-learning, sql     Job description  The Data Scientist is an individual contributor that should be able to apply quantitative, data science and analytical skills to complex problems. He/she should be able to work across teams to design, develop, and evaluate and execute against those data science and analytical solutions with a keen functional understanding of the business problem. He/she will be responsible for data wrangling, data analysis, modeling, including model selection and producing quick applicable modeling solutions. The position will serve as a thought leader including advising on optimal solutions and opining on challenger models. The role works on strategic, highly visible projects firm wide. It is an opportunity to have meaningful impact on a large scale at a leading financial services firm. The role will develop data-centric solutions that move the bottom line for the firm. In Corporate Technology Machine Learning at JPMorgan Chase, our role involves solving challenging business problems through data science and machine learning techniques across all the corporate functions, including Risk, Compliance, Finance, HR, Legal, and Audit. This role requires a wide variety of strengths and capabilities, including:  * Advanced degree in analytical field (e.g., Data Science, Computer Science, Engineering, Applied Mathematics, Statistics, Data Analysis, Operations Research)  * Extensive practical expertise and work experience with Machine Learning, both supervised and unsupervised. Deep Learning (neural network) experience is preferred  * Experience across broad range of modern analytic and data tools, particularly Python/Anaconda and/or R, XGBoost, Tensorflow and/or Keras, Spark, Hive, SQL  * Experience working with engineering teams to operationalize Machine Learning models  * Excellent problem solving, communications, and teamwork skills Financial service background preferred, but not required JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management. We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs. Equal Opportunity Employer/Disability/Veterans","state":"TX","country":"US","employment_type":"FULL_TIME","company_name":"JPMorgan Chase & Co.","company_url":"https://www.jpmorganchase.com"},{"job_title":"Data Scientist","skills":["machine-learning","r","sql","hive","pandas"],"description":"About this job \r\n  Location options:  Remote    Job type:  Full-time    Experience level:  Mid-Level, Senior    Role:  Data Scientist    Industry:  Travel & Tourism    Company size:  201-500 people    Company type:  VC Funded       Technologies   machine-learning, r, sql, hive, pandas     Job description    THE ROLE  \r\n At Hopper, every dataset tells a story. Do you have what it takes to decipher the clues?  bit.ly/2q6U8dq  We&rsquo;re looking for a data-savvy individual to join our team as a Sr. Data Scientist to drive data-centric product development and revenue growth, as well as lead risk management, for risk-based services which make up 70% of our overall revenue! You may be a great fit for our team if you are excited about exploring huge (and sometimes messy) data sets and finding effective ways to simplify and communicate the results to a non-technical audience. \r\n  IN THIS ROLE, YOU WILL:  \r\n \r\n Frame and conduct complex exploratory analyses needed to deepen our understanding of our users. Partner with product, business and strategy teams to contribute to product improvements and initiatives \r\n Use machine learning and big data tools on tremendously large and complex data to deepen our data-driven advice and personalized modeling \r\n Conduct research into various aspects of our business and employ statistical and modeling techniques when appropriate to make recommendations to non-technical stakeholders \r\n \r\n  AN IDEAL CANDIDATE HAS:  \r\n \r\n A degree in Math, Statistics, Computer Science, Engineering or other quantitative disciplines \r\n Extremely strong analytical and problem-solving skills \r\n Proven ability to communicate complex technical work to a non-technical audience \r\n A strong passion for and extensive experience in conducting empirical research and answering hard questions with data \r\n Experience with relational databases and SQL, especially Hive \r\n Experience working with extremely large data sets \r\n Experience in Pandas, R, SAS or other tools appropriate for large scale data preparation and analysis \r\n Experience with data mining, machine learning, statistical modeling tools and underlying algorithms \r\n Proficiency with Unix/Linux environments \r\n \r\n  BENEFITS:   Well-funded and proven startup with large ambitions, competitive salary and stock options  Dynamic and entrepreneurial team where pushing limits is everyday business  100% employer paid medical, dental, vision, disability and life insurance plans  Access to a 401k (US) or Retirement Savings Plan (Canada)","employment_type":"FULL_TIME","company_name":"Hopper","company_url":"http://www.hopper.com"},{"job_title":"Senior Data Scientist - Data Foundation","skills":["python","sql"],"description":"About this job \r\n  Compensation:  Equity    Location options:  Remote, Paid relocation    Job type:  Full-time    Experience level:  Senior    Role:  Data Scientist    Industry:  Media, Music, podcasts    Company size:  5k-10k people    Company type:  Public       Technologies   python, sql     Job description   The Platform team creates the technology that enables Spotify to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many disciplines, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers. Join us and help to amplify productivity, quality and innovation across Spotify. We're looking for a Senior Data Scientist to join Spotify's Data Foundations team. In Data Foundations, the solutions we build impact hundreds of Spotify engineers and data scientists, and thousands of daily data processing jobs: ultimately the user experience of hundreds of MILLIONS of users via more data-informed recommendations and user-experience! As a Senior Data Scientist you will help drive a data-first culture across Spotify, working with a hardworking group of engineers and product managers to develop a detailed understanding of our data ecosystem and develop new strategies for measuring and visualising how data works at Spotify.  \r\n  What You' ll do  \r\n \r\n \r\n Work closely with a cross-functional, geographically distributed team of data scientists, user researchers, product managers, designers and engineers across New York, Stockholm and London. \r\n Define metrics and build and analyze dashboards, reports and key datasets to drive data-informed product development. \r\n Apply thorough analysis to understand and detail sophisticated workflows, data flows and processes. \r\n Communicate insights and recommendations to key partners, helping to activate data standard methodologies in Data Foundations, and more broadly in the data, insights and engineering communities across all of Spotify. \r\n Develop and innovate on our mixed-methods insights practice, and contribute to the wider Insights community at Spotify. \r\n Work from our offices in New York (With the current situation regarding COVID-19, this role will be remote until it's appropriate to work from the office). \r\n \r\n \r\n  Who you are  \r\n \r\n \r\n You have significant professional experience, and a degree in statistics, mathematics, computer science, economics or another quantitative subject area. \r\n You are a communicative person who values building strong relationships with colleagues and partners and enjoys mentoring and guiding others. \r\n You know how to seek loosely defined problems and come up with meaningful answers and impactful insights. \r\n You have an understanding of how to instrument products to accurately collect user and system behaviors through data for a wide variety of insight and product development use cases. \r\n You have hands-on experience synthesizing insights from data using tools such as Python, R, BigQuery, SQL, Tableau. \r\n \r\n \r\n You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what&rsquo;s playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It&rsquo;s in our differences that we will find the power to keep revolutionizing the way the world listens. Spotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world&rsquo;s most popular audio streaming subscription service with a community of more than 345 million users.","state":"NULL","country":"US","employment_type":"FULL_TIME","company_name":"Spotify","company_url":"http://www.spotifyjobs.com"},{"job_title":"Data Scientist (Master's Degree)","skills":["python","r","hadoop","machine-learning"],"description":"About this job \r\n  Compensation:  $100k - 120k    Location options:  Paid relocation    Job type:  Full-time    Experience level:  Mid-Level    Role:  Data Scientist    Industry:  Cybersecurity, Data & Analytics, Digital Marketing    Company size:  10k+ people    Company type:  Public       Technologies   python, r, hadoop, machine-learning     Job description  Job Description\r\n\r\n\r\n\r\n\r\n\r\n Information Technology (IT) at Procter &amp; Gamble is where business, innovation and technology integrate to create a competitive advantage for P&amp;G. Our mission is clear -- we deliver IT to help P&amp;G win with the over 5 billion consumers we serve worldwide. Our IT professionals are diverse business leaders who apply IT excellence to deliver groundbreaking business models and capabilities for our 65 iconic, trusted brands. From Day 1, you&rsquo;ll be asked to dive right in, take the lead, use your initiative, and build billion-dollar brands that help make everyday activities easier and make the world a better place. You&rsquo;ll be doing meaningful work that takes your career places you never envisioned. And you&rsquo;ll do this in creative workspaces where new ideas flourish and where your technical expertise is recognized and rewarded. Description Do you enjoy design research and analytic frameworks? How would you like to use your creative and analytical skills alongside business leadership in your everyday work? If this sounds appealing, we would love to hire someone with your skills and abilities! As a Data Scientist, you'll be using Big Data and advanced analytics to direct the engagement of our business leaders. - Collaborating actively across functional partners and senior management to accomplish various project objectives. - Executing research and analytics, including data source identification, processing, model/algorithm development. - Turning insights into meaningful recommendations which will drive business value creation. We need someone who is technically capable as a Data Scientist. You will get into the details of the data, demonstrating artificial intelligence and analytic tools (R, Python, Scala, Spark, TensorFlow, Hadoop, KNIME, etc.) to unlock business building insights in our mountains of data. You must be adept at demonstrating technologies for solving ad hoc business problems, innovating on potential future solutions, and working with technology partners to translate your innovations into robust, scaled, analytic solutions The Value of a P&amp;G Career - Ongoing coaching and career development &ndash; you will work with passionate people and have access to best in class training through our P&amp;G Leadership Academy as well as day-to-day mentoring from your manager - We provide a market-competitive salary benchmarked against the finest companies, so you'll be able to spend your generous vacation time doing more of the things you love with the people you love - We offer a suite of benefits, including but not limited to: flexible working arrangements, generous paid vacation increasing with service, generous parental leave policies, group life insurance, health insurance, and dedicated support to help you find the right child care or elder care - Additional perks include discounted P&amp;G products from our company shops and a discount platform offering you unbeatable savings on everything from groceries to exotic holidays - What's more, your financial package might include things like interest-free loans, a tax-advantageous share purchase plan, a contributory \r\n Required - Pursuing or has graduated with a Masters in a quantitative field (Operation Research, Computer Science, Engineering, Applied Math, Statistics, Physics, Analytics, etc.) or have equivalent work experience. - Proven leadership in applying and scaling Analytic techniques to deliver impactful insights from data (in academics or in industry. - Strong written and verbal communication skills to influence others to take action. - Able to balance multiple priorities. - Good social skills, self-motivated, dynamic with a can-do mentality. - Strong enthusiasm and curiosity about the intersection of business and technology Preferred - 2-4 years of Data Science Experience - Experience in disrupting current business practices in CPG or related industries to help crafting a new go-to-market models. - Experience with Analytical Tools/Applications including: - Unix/Linux - Big Data Ecosystem: Hadoop, Spark, MapReduce, SQL, HIV - Scientific Computing: R, Python, C++, Java, Scala, etc. - High-Performance Parallel and Distributing Computing - Deep Learning frameworks: Keras, Tensorflow - Data Visualization - Data Management Systems - Business Intelligence tools: such as KNIME, Tableau All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, disability status, age, sexual orientation, gender identity and expression, marital status, citizenship, HIV/AIDS status or any other legally protected factor. Immigration sponsorship is not available for this role. As a general matter, Procter &amp; Gamble does not sponsor candidates for nonimmigrant visas or permanent residency. However, Procter &amp; Gamble may make exceptions on a discretionary basis. Any exceptions would be based on the Company's specific business needs at the time and place of recruitment as well as the particular qualifications of the individual. Procter &amp; Gamble participates in e-verify as required by law. Qualified individuals will not be disadvantaged based on being unemployed.","state":"OH","country":"US","employment_type":"FULL_TIME","company_name":"The Procter & Gamble Company","company_url":"http://pgcareers.com/informationtechnology","min_salary":100000,"max_salary":120000},{"job_title":"Senior Data Scientist","skills":["python","sql","numpy","analytics","amazon-web-services"],"description":"About this job \r\n  Location options:  Remote    Job type:  Full-time    Experience level:  Mid-Level, Senior, Lead    Role:  Data Scientist    Industry:  Software Development    Company size:  201-500 people    Company type:  Private       Technologies   python, sql, numpy, analytics, amazon-web-services     Job description   Our 100% remote team of 200+ CleverPeople are seasoned yet friendly professionals who want to collaborate and welcome you. We have an exciting new opening for a Senior Data Scientist. \r\n\r\n\r\n\r\n\r\n  What we're working on  \r\n Enterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve every day are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. We are hiring team members who are passionate and energized by the vision of empowering our customers in a complex industry through technology, data and a deep understanding of client concerns. In order to grasp the scale of problems we face, ideally, you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries. \r\n\r\n\r\n\r\n\r\n  Requirements  \r\n \r\n 7+ years experience in a senior developer role using Python; ideally, you have delivered business-critical software to large enterprises \r\n Experience with predictive analytics, pandas/NumPy \r\n You are comfortable manipulating large data sets and handle raw SQL \r\n Experience using technologies such as Airflow, Spark, Kafka, AWS Glue and StreamSets \r\n The eCommerce industry experience preferred \r\n English fluency, verbal and written \r\n Personality traits: Professional, problem solver, proactive, passionate, team player.","employment_type":"FULL_TIME","company_name":"Clevertech","company_url":"https://www.clevertech.biz"},{"job_title":"Senior Data Scientist","skills":["python","amazon-sagemaker","tensorflow","pytorch","sql"],"description":"About this job \r\n  Compensation:  $135k - 180k    Location options:  Remote    Job type:  Full-time    Role:  Data Scientist    Industry:  Beauty, Health & Fitness, Marketplace    Company size:  51-200 people    Company type:  VC Funded       Technologies   python, amazon-sagemaker, tensorflow, pytorch, sql     Job description    Senior Data Scientist   \r\n   100% Remote (U.S. Based Only)   \r\n  About StyleSeat:  \r\n  At StyleSeat, our mission is to help people look and feel their best. We are on the path to achieving this mission by being the go-to marketplace for consumers to discover, book, and pay for beauty and grooming services (hair stylists, colorists, nail artists, estheticians, barbers, etc). We are also the premier solution for all independent professionals in the industry to run and grow their business. We have powered over 120 million appointments booked and   $10B in revenue for small businesses   and are on the path to much more.  \r\n  As a Senior Data Scientist at StyleSeat, you will have a rare opportunity to join a startup empowering small business owners across the country to be more successful doing what they love. Our team believes in discipline, hustle and supporting each other to make a positive impact for our community and bottom line. We believe that diversity makes us stronger and helps us better support our customers. Our community is the center of everything we do.  \r\n  About the Role:  \r\n  We are a   greenfield   team focused on Data Science which sits at the epicenter of the business and work closely with our sister teams in Data Engineering and Business Intelligence. This is an extremely exciting time for Data Science at StyleSeat as we are at the early stages of defining our roadmap, which you will have an opportunity to influence. Our work will have an impact and add value to multiple domains, from engineering, marketing, and product, to the executive team.   \r\n  We are looking for a driven Senior Data Scientist with software engineering experience to help take the StyleSeat experience to the next level of intelligence and joy. This role will work on core machine learning algorithms and systems that are part of our ability to understand the behavior and goals of our professional and client communities and build outstanding products - in short, these models help our clients feel their best and enable our pros to grow their business. It will involve a wide variety of skills and innovation and is an unusual opportunity that sits at the cutting-edge of various engineering disciplines, and the work will have a huge impact on hundreds of millions of users across the US.  \r\n  What You Can Bring to the Table:  \r\n \r\n  5+ years of experience working in a production environment  \r\n  Experience with the Python scientific stack (numpy, scipy, matplotlib, pandas, scikit-learn, etc.)  \r\n  Fluent in SQL  \r\n  Experience designing, training, tuning, deploying and maintaining custom machine learning models including state-of-the-art neural networks  \r\n  Experience applying one or more major deep learning packages (e.g. TensorFlow, PyTorch) to very large data sets  \r\n  Comfortable owning and guiding machine learning projects from conception through research, development and production deployment  \r\n \r\n  Nice-to-Haves:  \r\n\r\n \r\n   Experience working cross-functionally with other business units such as engineering, product, and marketing   \r\n  Ability to explain and present machine learning concepts to both a technical and non-technical Audience   \r\n  Experience identifying opportunities in Product that can benefit from machine learning  \r\n  Experience transferring machine learning solutions to engineers on product teams  \r\n  Experience with AWS services (SageMaker, S3, etc.)","employment_type":"FULL_TIME","company_name":"StyleSeat","company_url":"http://www.styleseat.com/m/","min_salary":135000,"max_salary":180000},{"job_title":"Data Scientist – Network Analysis and Control","skills":["r","d3.js","python","scala"],"description":"About this job \r\n  Location options:  Paid relocation    Job type:  Full-time    Experience level:  Mid-Level    Role:  Data Scientist    Industry:  Cybersecurity, Data Science, Machine Learning    Company size:  5k-10k people    Company type:  Private       Technologies   r, d3.js, python, scala     Job description   MITRE&rsquo;s Infrastructure and Networking Technical Center is looking for a motivated and passionate data scientist to join our Network Analytics department. As part of a collaborative team of scientists and engineers, you will have an opportunity to apply machine learning and data-centric approaches to complex networks. Our multidisciplinary team thrives on the opportunity to tackle new challenges in the public interest, looking for solutions that no one else has considered. We approach problems with an entrepreneurial mindset, a willingness to take risks, and a desire to advance the state of the art for intelligent networks, all while contributing to MITRE&rsquo;s mission of Solving Problems for a Safer World. \r\n  Responsibilities include:  \r\n \r\n Develop prototypes of intelligent network capabilities in MITRE advanced labs \r\n Work on collaborative research teams to develop innovative solutions using commercial and MITRE developed technologies \r\n Conduct performance assessments of current and emerging technologies \r\n Execute data science research beginning at data wrangling and cleaning all the way through to reporting and visualization \r\n Scale solutions to work across large enterprises and large data sets \r\n Analyze data from network sensor systems and integrate additional data sources for improved outcomes \r\n Communicate technical approach and findings to internal and external stakeholders \r\n \r\n  Basic Qualifications:  \r\n \r\n BS degree and 2 years related experience \r\n Applicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information or applicants who are eligible for security clearances. \r\n \r\n  Required Qualifications:  \r\n \r\n Degree in Computer Science, Mathematics, Statistics, or similar field \r\n A passion for technology and a desire to learn \r\n Excellent written and verbal communication skills \r\n Ability to apply, modify and formulate algorithms and processes to solve challenging problems \r\n Hands-on software development skills in a modern programming language (e.g. Python, R, Scala, Java) \r\n Working knowledge of data science workflow from data acquisition to reporting findings \r\n Understanding of streaming and batch data workflows, including message queues, processing directed acyclic graphs (DAGs) and data stores \r\n Experience working with Big Data tools (e.g. Spark, Hadoop, Kafka) \r\n Experience working with databases (e.g., PostgreSQL, Oracle, MySQL, MongoDB, Neo4j, Elasticsearch) \r\n Knowledge of various machine learning paradigms (deep learning, reinforcement learning, neural networks, etc.) with an understanding of mathematical underpinnings of various models \r\n Ability to obtain and maintain a Secret security clearance \r\n \r\n  Preferred Qualifications:  \r\n \r\n Advanced degree in Computer Science, Mathematics, Statistics, or similar field \r\n Familiarity with cloud-based environments like Amazon Web Services, Google Cloud, or Microsoft Azure \r\n Experience conducting original research using data science techniques, including machine learning, statistical modeling, and data visualization \r\n Demonstrated ability to manipulate large datasets and perform calculations leveraging a modern programming language \r\n Familiarity with basic networking and security concepts/capabilities such as TCP/IP stack, routing, and firewalls \r\n Exposure to network programmability concepts such as software define networking and programmable data planes","state":"MA","country":"US","employment_type":"FULL_TIME","company_name":"MITRE","company_url":"http://mitre.org"}]
