{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Data Scientist"],"skills":[["sql"],["r"],["machine-learning"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Financial Services<\/strong><\/span><br/><span>Company size: <strong>10k+ people<\/strong><\/span><br/><span>Company type: <strong>Public<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>sql, r, machine-learning<\/p> <br/><br/><h2>Job description<\/h2> As a Data Scientist,<br>• You will be working with product owners, program managers, developers, business stakeholders, and executives to deeply understand customer problems and priorities.<br>• You will lead cross-functional projects by applying your analysis techniques to create advanced data modeling and discover insights. These insights that will be foundations for strategic decisions and uncover optimization opportunities.<br>• You will dive into various datasets, becoming a subject matter expert on the data generated by and used by our User Experience, Product, Client onboarding, Support, and service teams. Your expertise will be catalyst to growth.<br>• You will be comfortable with big data systems, intimately familiar with machine learning and statistical methods, and experienced in applying these to solve business problems.<br>• You will shepherd models through the internal validation process, participate in overall project design and delivery with QA's other functional teams and end clients.<br>• You will provide support for audits of model development and implementation by both internal and external auditors.<p>What we're looking for:<br>• Postgraduate university degree in the quantitative discipline required (ex. Statistics, Operations Research, Economics, Computer Science, Engineering). Graduate studies, Masters or Ph.D. required.<br>• Extensive knowledge of data analysis, theory, and statistical techniques (such as linear or nonlinear models, logistic regression, machine learning, macroeconomic forecast, decision trees, cluster analysis, neural networks, etc.)<br>• Strong (at least 3 years) Python, Hive, Elastic Search, and SQL programming skills.<br>Skills that will help you in the role:<br>• Analytical skills - Knowledge of data & analytics. Ability to work independently on analytical tasks.<br>• Teamwork - Ability to work with and in cross-functional teams and virtual teams across locations.<br>• Conceptual thinking - Ability to think strategically about analytics and their value to the organization.<br>• Communication-Ability to think quickly & relay information to technical and non-technical audiences. You will share a range of information, reasoning, insights, and recommendations that will drive decisions by our key stakeholder teams, from simple SQL queries to more advanced long-term modeling and strategic analysis.<br>• A strong bias towards delivering results while dealing with ambiguity in fast-paced, dynamic environments.<p>JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.<p>We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.<p>Equal Opportunity Employer/Disability/Veterans<\/p> <br/><br/>"],"datePosted":["2021-10-02"],"validThrough":["2021-12-30"],"employmentType":["FULL_TIME"],"industry":[["Financial Services"]],"jobBenefits":[["Healthcare and Insurance Plans"],["Wellness Programs"],["Maternity and Paternity Leave, Adoption Assistance"],["Retirement Savings Programs"],["Paid Time Off"],["Tuition Assistance"],["Access to Arts and Entertainment Program"],["Stock Purchase Plan"],["Charitable Contribution Matching"],["Learning & Development Resources"]],"hiringOrganization":{"@type":["Organization"],"name":["JPMorgan Chase & Co."],"sameAs":["https://www.jpmorganchase.com"],"logo":["https://i.stack.imgur.com/RsT3S.png"]},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"],"addressRegion":["NJ"],"addressLocality":["Jersey City"]}}]}
