{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Senior Data Science Engineer"],"skills":[["machine-learning"],["r"],["python"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Financial Services<\/strong><\/span><br/><span>Company size: <strong>10k+ people<\/strong><\/span><br/><span>Company type: <strong>Public<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>machine-learning, r, python<\/p> <br/><br/><h2>Job description<\/h2> As an experienced member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<p>We are seeking a Senior Data Science Engineer with strong analytical and statistical skills to use advanced analytics and modeling / machine learning skills to lead the GIAM Data Science Function and transform traditional access management practices by leveraging data science. The candidate will need a combination of business focus, strong analytical and problem solving skills and programming knowledge to be able to cycle through data, propose and implement a new solution. In this role, you will have an excellent career path and numerous opportunities for both personal and professional development in an intellectually stimulating environment.<p>Responsibilities include:<br> * Collaborate across Identity and Access Management, as well as other data science groups, to deliver data driven insights, recommendations, and solutions that solve important business problems<br> * Lead Data Science Initiatives and drive the research and development of high quality machine learning models and services to deliver these insights and solutions<br> * Manage the relationship with internal clients, gathering requirements, understanding business domain, presenting results, and developing a trusted adviser relationship<br> * Operate across a wide range of ML approaches, including unsupervised, supervised, and reinforcement learning, for tasks including natural language processing (NLP), data anomaly detection, classification, graph analysis, pattern detection, leveraging methods including tree ensembles, neural networks, and clustering techniques<br> * Provide thought leadership, subject matter expertise and serve as trusted advisor in the analytics discipline<br> * Manage full lifecycle of data science projects and solutions - including ideation, data acquisition / exploration/ engineering, prototyping, and productionization<br> * Partner with the Identity and Access Management Data Platform team on in the creation of capabilities which accelerate data science delivery<br> * Work independently and collaboratively (as needed) within the team to achieve the desired outcomes of an data science efforts<p>This role requires a wide variety of strengths and capabilities, including:<br> * BS/BA degree or equivalent experience<br> * Expertise in application, data, and infrastructure architecture disciplines<br> * Advanced knowledge of architecture and design across all systems<br> * Proficiency in multiple modern programming languages<br> * Knowledge of industry-wide technology trends and best practices<br> * Keen understanding of financial control and budget management<br> * Ability to work in large, collaborative teams to achieve organizational goals<br> * Passionate about building an innovative culture<br> * M.S. or Ph.D. in Statistics, Engineering, Computer Science, Mathematics, Economics or related quantitative field preferred<br> * Extensive hands on experience in data mining, machine learning, predictive modeling in a large-scale, corporate environment<br> * Solid coding skills in Python and SQL required; experience with R, SAS, Splunk or other equivalent languages in different environments preferred<br> * Deep knowledge in Machine Learning, Data Mining, Information Retrieval<br> * Major machine learning frameworks, including Anaconda and Tensorflow<br> * Excellent analytical and critical thinking skills<br> * Self-starter with great skills in teamwork, partnership, and communications both verbal and written<br> * Experience delivering Data Science capabilities on a cloud platform (ex: AWS, Azure, Google)<br> * Knowledge of Identity and Access Domain is a plus<p>JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.<p>We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.<p>Equal Opportunity Employer/Disability/Veterans<\/p> <br/><br/>"],"datePosted":["2021-10-06"],"validThrough":["2021-12-30"],"employmentType":["FULL_TIME"],"industry":[["Financial Services"]],"jobBenefits":[["Healthcare and Insurance Plans"],["Wellness Programs"],["Maternity and Paternity Leave, Adoption Assistance"],["Retirement Savings Programs"],["Paid Time Off"],["Tuition Assistance"],["Access to Arts and Entertainment Program"],["Stock Purchase Plan"],["Charitable Contribution Matching"],["Learning & Development Resources"]],"hiringOrganization":{"@type":["Organization"],"name":["JPMorgan Chase & Co."],"sameAs":["https://www.jpmorganchase.com"],"logo":["https://i.stack.imgur.com/RsT3S.png"]},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"],"addressRegion":["NJ"],"addressLocality":["Jersey City"]}}]}
