{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Data Scientist – Network Analysis and Control"],"skills":[["r"],["d3.js"],["python"],["scala"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Location options: <strong>Paid relocation<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Mid-Level<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Cybersecurity, Data Science, Machine Learning<\/strong><\/span><br/><span>Company size: <strong>5k-10k people<\/strong><\/span><br/><span>Company type: <strong>Private<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>r, d3.js, python, scala<\/p> <br/><br/><h2>Job description<\/h2> <p>MITRE&rsquo;s Infrastructure and Networking Technical Center is looking for a motivated and passionate data scientist to join our Network Analytics department. As part of a collaborative team of scientists and engineers, you will have an opportunity to apply machine learning and data-centric approaches to complex networks. Our multidisciplinary team thrives on the opportunity to tackle new challenges in the public interest, looking for solutions that no one else has considered. We approach problems with an entrepreneurial mindset, a willingness to take risks, and a desire to advance the state of the art for intelligent networks, all while contributing to MITRE&rsquo;s mission of Solving Problems for a Safer World.<\/p>\r\n<p><strong>Responsibilities include:<\/strong><\/p>\r\n<ul>\r\n<li>Develop prototypes of intelligent network capabilities in MITRE advanced labs<\/li>\r\n<li>Work on collaborative research teams to develop innovative solutions using commercial and MITRE developed technologies<\/li>\r\n<li>Conduct performance assessments of current and emerging technologies<\/li>\r\n<li>Execute data science research beginning at data wrangling and cleaning all the way through to reporting and visualization<\/li>\r\n<li>Scale solutions to work across large enterprises and large data sets<\/li>\r\n<li>Analyze data from network sensor systems and integrate additional data sources for improved outcomes<\/li>\r\n<li>Communicate technical approach and findings to internal and external stakeholders<\/li>\r\n<\/ul>\r\n<p><strong>Basic Qualifications:<\/strong><\/p>\r\n<ul>\r\n<li>BS degree and 2 years related experience<\/li>\r\n<li>Applicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information or applicants who are eligible for security clearances.<\/li>\r\n<\/ul>\r\n<p><strong>Required Qualifications:<\/strong><\/p>\r\n<ul>\r\n<li>Degree in Computer Science, Mathematics, Statistics, or similar field<\/li>\r\n<li>A passion for technology and a desire to learn<\/li>\r\n<li>Excellent written and verbal communication skills<\/li>\r\n<li>Ability to apply, modify and formulate algorithms and processes to solve challenging problems<\/li>\r\n<li>Hands-on software development skills in a modern programming language (e.g. Python, R, Scala, Java)<\/li>\r\n<li>Working knowledge of data science workflow from data acquisition to reporting findings<\/li>\r\n<li>Understanding of streaming and batch data workflows, including message queues, processing directed acyclic graphs (DAGs) and data stores<\/li>\r\n<li>Experience working with Big Data tools (e.g. Spark, Hadoop, Kafka)<\/li>\r\n<li>Experience working with databases (e.g., PostgreSQL, Oracle, MySQL, MongoDB, Neo4j, Elasticsearch)<\/li>\r\n<li>Knowledge of various machine learning paradigms (deep learning, reinforcement learning, neural networks, etc.) with an understanding of mathematical underpinnings of various models<\/li>\r\n<li>Ability to obtain and maintain a Secret security clearance<\/li>\r\n<\/ul>\r\n<p><strong>Preferred Qualifications:<\/strong><\/p>\r\n<ul>\r\n<li>Advanced degree in Computer Science, Mathematics, Statistics, or similar field<\/li>\r\n<li>Familiarity with cloud-based environments like Amazon Web Services, Google Cloud, or Microsoft Azure<\/li>\r\n<li>Experience conducting original research using data science techniques, including machine learning, statistical modeling, and data visualization<\/li>\r\n<li>Demonstrated ability to manipulate large datasets and perform calculations leveraging a modern programming language<\/li>\r\n<li>Familiarity with basic networking and security concepts/capabilities such as TCP/IP stack, routing, and firewalls<\/li>\r\n<li>Exposure to network programmability concepts such as software define networking and programmable data planes<\/li>\r\n<\/ul> <br/><br/>"],"datePosted":["2021-10-03"],"validThrough":["2022-02-19"],"employmentType":["FULL_TIME"],"experienceRequirements":["Mid-Level"],"industry":[["Cybersecurity"],["Data Science"],["Machine Learning"]],"jobBenefits":[["Comprehensive Health Care Programs"],["Generous Company Matching Contributions"],["Paid Time Off Bank"],["Tuition Reimbursement"],["Reimbursement for Fitness Expenses"],["Healthcare Flexible Spending Accounts"],["Pet, Auto, Homeowner, and Renter Insurance"],["Identity Theft Protection"]],"hiringOrganization":{"@type":["Organization"],"name":["MITRE"],"sameAs":["http://mitre.org"],"logo":["https://i.stack.imgur.com/7GNjd.png"],"description":["<p>MITRE&rsquo;s mission-driven teams are dedicated to solving problems for a safer world. Through our public-private partnerships and federally funded R&amp;D centers, we work across government and in partnership with industry to tackle challenges to the safety, stability, and well-being of our nation.<\/p>"]},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"],"addressRegion":["MA"],"addressLocality":["Bedford"],"streetAddress":["200 Burlington Road"],"postalCode":["01730"]}}]}
