{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Senior Data Scientist"],"skills":[["python"],["amazon-sagemaker"],["tensorflow"],["pytorch"],["sql"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Compensation: <strong>$135k - 180k<\/strong><\/span><br/><span>Location options: <strong>Remote<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Beauty, Health & Fitness, Marketplace<\/strong><\/span><br/><span>Company size: <strong>51-200 people<\/strong><\/span><br/><span>Company type: <strong>VC Funded<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>python, amazon-sagemaker, tensorflow, pytorch, sql<\/p> <br/><br/><h2>Job description<\/h2> <p><strong>Senior Data Scientist <\/strong><\/p>\r\n<p><em><span>100% Remote (U.S. Based Only)<\/span><\/em><\/p>\r\n<p><strong>About StyleSeat:<\/strong><\/p>\r\n<p><span>At StyleSeat, our mission is to help people look and feel their best. We are on the path to achieving this mission by being the go-to marketplace for consumers to discover, book, and pay for beauty and grooming services (hair stylists, colorists, nail artists, estheticians, barbers, etc). We are also the premier solution for all independent professionals in the industry to run and grow their business. We have powered over 120 million appointments booked and<\/span><strong> $10B in revenue for small businesses <\/strong><span>and are on the path to much more.<\/span><\/p>\r\n<p><span>As a Senior Data Scientist at StyleSeat, you will have a rare opportunity to join a startup empowering small business owners across the country to be more successful doing what they love. Our team believes in discipline, hustle and supporting each other to make a positive impact for our community and bottom line. We believe that diversity makes us stronger and helps us better support our customers. Our community is the center of everything we do.<\/span><\/p>\r\n<p><strong>About the Role:<\/strong><\/p>\r\n<p><span>We are a <\/span><strong>greenfield<\/strong><span> team focused on Data Science which sits at the epicenter of the business and work closely with our sister teams in Data Engineering and Business Intelligence. This is an extremely exciting time for Data Science at StyleSeat as we are at the early stages of defining our roadmap, which you will have an opportunity to influence. Our work will have an impact and add value to multiple domains, from engineering, marketing, and product, to the executive team. <\/span><\/p>\r\n<p><span>We are looking for a driven Senior Data Scientist with software engineering experience to help take the StyleSeat experience to the next level of intelligence and joy. This role will work on core machine learning algorithms and systems that are part of our ability to understand the behavior and goals of our professional and client communities and build outstanding products - in short, these models help our clients feel their best and enable our pros to grow their business. It will involve a wide variety of skills and innovation and is an unusual opportunity that sits at the cutting-edge of various engineering disciplines, and the work will have a huge impact on hundreds of millions of users across the US.<\/span><\/p>\r\n<p><strong>What You Can Bring to the Table:<\/strong><\/p>\r\n<ul>\r\n<li><span>5+ years of experience working in a production environment<\/span><\/li>\r\n<li><span>Experience with the Python scientific stack (numpy, scipy, matplotlib, pandas, scikit-learn, etc.)<\/span><\/li>\r\n<li><span>Fluent in SQL<\/span><\/li>\r\n<li><span>Experience designing, training, tuning, deploying and maintaining custom machine learning models including state-of-the-art neural networks<\/span><\/li>\r\n<li><span>Experience applying one or more major deep learning packages (e.g. TensorFlow, PyTorch) to very large data sets<\/span><\/li>\r\n<li><span>Comfortable owning and guiding machine learning projects from conception through research, development and production deployment<\/span><\/li>\r\n<\/ul>\r\n<p><strong>Nice-to-Haves:<\/strong><\/p>\r\n\r\n<ul>\r\n<li><strong><span>Experience working cross-functionally with other business units such as engineering, product, and marketing<\/span><\/strong><\/li>\r\n<li><span>Ability to explain and present machine learning concepts to both a technical and non-technical Audience <\/span><\/li>\r\n<li><span>Experience identifying opportunities in Product that can benefit from machine learning<\/span><\/li>\r\n<li><span>Experience transferring machine learning solutions to engineers on product teams<\/span><\/li>\r\n<li><span>Experience with AWS services (SageMaker, S3, etc.)<\/span><\/li>\r\n<\/ul> <br/><br/>"],"datePosted":["2021-09-27"],"validThrough":["2022-03-31"],"employmentType":["FULL_TIME"],"industry":[["Beauty"],["Health & Fitness"],["Marketplace"]],"jobBenefits":[["Unlimited Vacation Policy"],["StyleSeat Credit - Enjoy a haircut, facial, massage and so much more!"],["Reimbursement for music streaming account (Spotify, Pandora, et al.)"],["Wellness Plan ($75/mo.) - gym, yoga, therapy, ergonomic office equip."],["A whole day off to relax or celebrate your birthday"],["Week of rest between observed Christmas and New Years holidays"],["Big-company health plans & One Medical Concierge"],["Vanguard 401 (k) & FSA"],["Paid Parental Leave (Maternity/Paternity)"],["Internet Stipend ($35/mo.)"]],"hiringOrganization":{"@type":["Organization"],"name":["StyleSeat"],"sameAs":["http://www.styleseat.com/m/"],"logo":["https://i.stack.imgur.com/jchtF.png"],"description":["<p>StyleSeat is a marketplace that powers over $1b/year in hair and grooming services ($70b TAM). Our mission is to economically empower our entrepreneurs, of which, 80% are Women, and 50% are Black and People of Color. We've powered over $7.2b in revenue for our SMBs, 150m appointments, we're in 16k cities and we power over $200m a year in gross receipts. We give hard working professionals across the country the freedom to run their businesses independently and practice what they love every day.<\/p>\r\n<p>We are looking for individuals who can step up and be the CEO of their position, a real owner and self starter. Someone who puts the team first, but can also work independently and make decisions confidently. At StyleSeat, you will have a wide range and scope for your role, so you must be curious, data driven and dedicated to winning. Most importantly, we are looking for someone who cares deeply about supporting small business owners and helping people invest in themselves.<\/p>\r\n<p>At StyleSeat, we have shared ownership over problems and team members are encouraged to fill gaps and push initiatives to ensure we&rsquo;re all driving toward results and key objectives. Every single Engineer makes a huge impact on our Community and the Company&rsquo;s growth. All engineers have code in production within their first week. That&rsquo;s something we firmly believe in. And no matter what department you&rsquo;re in, you will regularly work on projects that directly touch our community. We promote from within and take chances on our talent; it&rsquo;s very much a part of our culture. Our CEO asks in every management meeting how we can be supporting and further investing in our team.<\/p>\r\n<p><strong><em>Here's what some of out tenured Engineers have to say:<\/em><\/strong><\/p>\r\n<p><em>&ldquo;StyleSeat is a company that cares about its customers and its engineers, visible through its actions rather than just words. Decisions are made with the customer first, and the customer is the center of product discussions. Engineers are given wide latitude to affect decisions and are integral to the overall decision making process. We are a small, relatively flat, tight-knit company, so there are always opportunities to make an impact across a variety of departments.&rdquo;<\/em> - Scott Stahl, Sr. Software Engineer<\/p>\r\n<p><em>\"StyleSeat is a forward-thinking San Francisco business with more women in the C-suite than many other companies. The diversity of the organization is clear not only in its own leadership, but also in the make-up of the beauty professionals on the platform. I love working for a company that supports diverse small businesses like StyleSeat does, and I love working with so many people that have the same passion.\"<\/em> - Mike Naughton, Sr. Software Engineer<\/p>\r\n<p><em>\"I've personally witnessed StyleSeat invest in the employees. I've seem those that joined before me, with me, and after me all grow into new roles and titles in a short time. There are lots of opportunities now, and as the company continues to grow, for career growth. <\/em><em>The organization is full of of a very smart set of people that are helpful, and passionate. You can trust the people you interact with to get the job done and the company at large to make the right decisions for its people, product and community. The product is real, has real customers and real dollars flow through it. I find it reassuring that changes are based on data and a/b tested to gather more knowledge before impacting the customer base.\"<\/em> - Jim Hribar, Manager of Engineering<\/p>"]},"baseSalary":{"@type":["MonetaryAmount"],"currency":["USD"],"value":{"@type":["QuantitativeValue"],"minValue":[135000],"maxValue":[180000],"unitText":["YEAR"]}},"jobLocationType":["TELECOMMUTE"],"applicantLocationRequirements":[{"@type":["Country"],"name":["US"]}]}
