{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Lead Data Scientist"],"skills":[["python"],["nlp"],["machine-learning"],["bigdata"],["apache-spark"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Compensation: <strong>£100k - 120k | Equity<\/strong><\/span><br/><span>Location options: <strong>Remote, Visa sponsor, Paid relocation<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Lead<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Cybersecurity, Machine Learning, Security Software<\/strong><\/span><br/><span>Company size: <strong>51-200 people<\/strong><\/span><br/><span>Company type: <strong>VC Funded<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>python, nlp, machine-learning, bigdata, apache-spark<\/p> <br/><br/><h2>Job description<\/h2> <p><strong>Data Science at Tessian<\/strong><\/p>\r\n<p>Our mission is to secure the human layer. This involves deploying near real-time machine learning models at massive scale to some of the world&rsquo;s largest organisations to keep their most sensitive data private and secure. To do this, we're looking for a senior data scientist with NLP experience ready to work on hard problems, drive best practice and cultivate an environment of experimentation and learning. Companies can leverage data science in a number of ways, and we think the role of a Data Scientist falls into three distinct categories:<\/p>\r\n<p>1) You work for a business function analysing &amp; reporting on how to improve a key metric, e.g increasing user conversion<\/p>\r\n<p>2) You are responsible for writing production models to enhance the main product, e.g recommendation systems for e-commerce<\/p>\r\n<p>3)<strong> You are the product <\/strong>- without machine learning, it wouldn't exist<\/p>\r\n<p>The Data Science team built the product at Tessian. We couldn't exist without our machine learning models; it&rsquo;s at the heart of what we do, and it&rsquo;s what our clients rely on day-to-day. We're searching for a Lead NLP Data Scientist who is excited about the opportunities and challenges that come with researching, building and deploying real-time production models. In this role you'll get to:<\/p>\r\n<ul>\r\n<li>Work across massive enterprise email datasets<\/li>\r\n<li>Defining and driving roadmap for technical excellence in Data Science at Tessian<\/li>\r\n<li>Deploy models to production that impacts directly our customers and products<\/li>\r\n<li>Improve our ML workflow<\/li>\r\n<li>Collaborate with engineering and product leaders to develop a product suite that is continually detecting more advanced threats for our customers<\/li>\r\n<li>Make your mark on leading ambitious projects<\/li>\r\n<li>Mentor and knowledge share with data scientists at Tessian<\/li>\r\n<\/ul>\r\n<p>We'd love to meet someone who:<\/p>\r\n<ul>\r\n<li>Has 6+ years Data Science experience<\/li>\r\n<li>Has experience leading Team at DS Product focus company<\/li>\r\n<li>Has strong NLP experience (in production)<\/li>\r\n<li>Has worked with, or understands the principles behind working with data at scale<\/li>\r\n<li>Can balance longer term projects alongside impactful quick wins<\/li>\r\n<li>Cares deeply about the impact their team hasIs a creative at heart, and can encourage novel ways of thinking in their team. This has always been a core part of the data science team&rsquo;s DNA<\/li>\r\n<li>Reads <a href=\"https://developers.google.com/machine-learning/guides/rules-of-ml\" rel=\"nofollow\">Rules of Machine Learning - Martin Zinkevich<\/a> and it resonates with how they think about machine learning and data science<\/li>\r\n<\/ul> <br/><br/>"],"datePosted":["2021-09-30"],"validThrough":["2021-12-12"],"employmentType":["FULL_TIME"],"incentiveCompensation":["Provides Equity"],"experienceRequirements":["Lead"],"industry":[["Cybersecurity"],["Machine Learning"],["Security Software"]],"jobBenefits":[["A full week of work-remote a year for non-remoters +25 days of holiday"],["Choice First! Flexible working hours and working from home"],["We’re family friendly, with policies built to support you"],["High-quality tech kit provided for you including Tessian ANC Headphone"],["If you're relocating, we'll provide a contribution to help with costs"],["A plethora of breakfast options, delicious snacks and drinks"],["Team lunch provided on Fridays"],["Elite membership of the Tessian House System..."],["Monthly team socials & a big, whole team extravaganza every quarter"]],"hiringOrganization":{"@type":["Organization"],"name":["Tessian"],"sameAs":["http://www.tessian.com"],"logo":["https://i.stack.imgur.com/Oa50N.png"],"description":["<p><a href=\"http://www.tessian.com/\" rel=\"nofollow\">Tessian<\/a> is a Sequoia-backed technology company whose mission is to keep the world's most sensitive data and systems private and secure.<\/p>\r\n<p>We're building the world's first <a href=\"https://www.tessian.com/platform\" rel=\"nofollow\">Human Layer Security (HLS) platform<\/a> to fulfil this mission. We&rsquo;re a team of mathematicians, data scientists &amp; engineers building breakthrough machine learning and natural language technology to analyse, understand &amp; protect enterprise email networks.<\/p>\r\n<p>In our most recent funding round, we raised<a href=\"https://fortune.com/2021/05/25/this-startup-just-landed-more-funding-to-bolster-its-fight-against-phishing/\" rel=\"nofollow\"> $74 million in our Series C led by March Capital<\/a>.<\/p>\r\n<p>We have ambitious growth plans, spanning all areas including our product offerings, engineering and data science teams, and our sales &amp; marketing divisions.<\/p>\r\n<p>We&rsquo;re excited about where this next phase of our growth will take us - we hope you are too, so we encourage you to apply today to be part of the next leg of the Tessian journey.<\/p>\r\n<p>We&rsquo;re backed by world-leading venture capital funds who&rsquo;ve invested in companies like Facebook, Slack, Dropbox, Improbable &amp; Transferwise &amp; we&rsquo;ve been named on the prestigious Forbes 30 Under 30 list, crowned the &ldquo;Best Security Startup&rdquo; by WIRED magazine, and awarded &ldquo;Best Innovation in Data Protection &amp; Privacy&rdquo; by CogX.<\/p>\r\n<p>Founded in 2013, Tessian is backed by world-class venture capital investors, has hubs in San Francisco, Boston, Austin, and London, and is one of the Top-3 2021 <a href=\"https://www.greatplacetowork.co.uk/awards/women/uks-best-workplaces-for-women-2021/\" rel=\"nofollow\">Best Places to Work for Women<\/a>.<\/p>"]},"baseSalary":{"@type":["MonetaryAmount"],"currency":["GBP"],"value":{"@type":["QuantitativeValue"],"minValue":[100000],"maxValue":[120000],"unitText":["YEAR"]}},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["GB"]}}]}
