{"@context":["http://schema.org"],"@type":["JobPosting"],"title":["Data Scientist (Master's Degree)"],"skills":[["python"],["r"],["hadoop"],["machine-learning"]],"description":["<h2>About this job<\/h2>\r\n<p><span>Compensation: <strong>$100k - 120k<\/strong><\/span><br/><span>Location options: <strong>Paid relocation<\/strong><\/span><br/><span>Job type: <strong>Full-time<\/strong><\/span><br/><span>Experience level: <strong>Mid-Level<\/strong><\/span><br/><span>Role: <strong>Data Scientist<\/strong><\/span><br/><span>Industry: <strong>Cybersecurity, Data & Analytics, Digital Marketing<\/strong><\/span><br/><span>Company size: <strong>10k+ people<\/strong><\/span><br/><span>Company type: <strong>Public<\/strong><\/span><br/><\/p><br/><br/><h2>Technologies<\/h2> <p>python, r, hadoop, machine-learning<\/p> <br/><br/><h2>Job description<\/h2> Job Description\r\n\r\n\r\n\r\n\r\n\r\n<p>Information Technology (IT) at Procter &amp; Gamble is where business, innovation and technology integrate to create a<br>competitive advantage for P&amp;G. Our mission is clear -- we deliver IT to help P&amp;G win with the over 5 billion consumers<br>we serve worldwide. Our IT professionals are diverse business leaders who apply IT excellence to deliver groundbreaking<br>business models and capabilities for our 65 iconic, trusted brands.<br>From Day 1, you&rsquo;ll be asked to dive right in, take the lead, use your initiative, and build billion-dollar brands that help<br>make everyday activities easier and make the world a better place. You&rsquo;ll be doing meaningful work that takes your<br>career places you never envisioned. And you&rsquo;ll do this in creative workspaces where new ideas flourish and where your<br>technical expertise is recognized and rewarded.<br>Description<br>Do you enjoy design research and analytic frameworks? How would you like to use your creative and analytical skills<br>alongside business leadership in your everyday work? If this sounds appealing, we would love to hire someone with your<br>skills and abilities!<br>As a Data Scientist, you'll be using Big Data and advanced analytics to direct the engagement of our business leaders.<br>- Collaborating actively across functional partners and senior management to accomplish various project objectives.<br>- Executing research and analytics, including data source identification, processing, model/algorithm development.<br>- Turning insights into meaningful recommendations which will drive business value creation.<br>We need someone who is technically capable as a Data Scientist. You will get into the details of the data, demonstrating<br>artificial intelligence and analytic tools (R, Python, Scala, Spark, TensorFlow, Hadoop, KNIME, etc.) to unlock business<br>building insights in our mountains of data. You must be adept at demonstrating technologies for solving ad hoc business<br>problems, innovating on potential future solutions, and working with technology partners to translate your innovations into<br>robust, scaled, analytic solutions<br>The Value of a P&amp;G Career<br>- Ongoing coaching and career development &ndash; you will work with passionate people and have access to best in class<br>training through our P&amp;G Leadership Academy as well as day-to-day mentoring from your manager<br>- We provide a market-competitive salary benchmarked against the finest companies, so you'll be able to spend your<br>generous vacation time doing more of the things you love with the people you love<br>- We offer a suite of benefits, including but not limited to: flexible working arrangements, generous paid vacation increasing<br>with service, generous parental leave policies, group life insurance, health insurance, and dedicated support to help you<br>find the right child care or elder care<br>- Additional perks include discounted P&amp;G products from our company shops and a discount platform offering you<br>unbeatable savings on everything from groceries to exotic holidays<br>- What's more, your financial package might include things like interest-free loans, a tax-advantageous share purchase<br>plan, a contributory<\/p>\r\n<p>Required<br>- Pursuing or has graduated with a Masters in a quantitative field (Operation Research, Computer Science, Engineering,<br>Applied Math, Statistics, Physics, Analytics, etc.) or have equivalent work experience.<br>- Proven leadership in applying and scaling Analytic techniques to deliver impactful insights from data (in academics or in<br>industry.<br>- Strong written and verbal communication skills to influence others to take action.<br>- Able to balance multiple priorities.<br>- Good social skills, self-motivated, dynamic with a can-do mentality.<br>- Strong enthusiasm and curiosity about the intersection of business and technology<br>Preferred<br>- 2-4 years of Data Science Experience<br>- Experience in disrupting current business practices in CPG or related industries to help crafting a new go-to-market<br>models.<br>- Experience with Analytical Tools/Applications including:<br>- Unix/Linux<br>- Big Data Ecosystem: Hadoop, Spark, MapReduce, SQL, HIV<br>- Scientific Computing: R, Python, C++, Java, Scala, etc.<br>- High-Performance Parallel and Distributing Computing<br>- Deep Learning frameworks: Keras, Tensorflow<br>- Data Visualization<br>- Data Management Systems<br>- Business Intelligence tools: such as KNIME, Tableau<br>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national<br>origin, protected veteran status, disability status, age, sexual orientation, gender identity and expression, marital status,<br>citizenship, HIV/AIDS status or any other legally protected factor.<br>Immigration sponsorship is not available for this role. As a general matter, Procter &amp; Gamble does not sponsor candidates<br>for nonimmigrant visas or permanent residency. However, Procter &amp; Gamble may make exceptions on a discretionary<br>basis. Any exceptions would be based on the Company's specific business needs at the time and place of recruitment as<br>well as the particular qualifications of the individual.<br>Procter &amp; Gamble participates in e-verify as required by law.<br>Qualified individuals will not be disadvantaged based on being unemployed.<\/p> <br/><br/>"],"datePosted":["2021-10-14"],"validThrough":["2021-12-07"],"employmentType":["FULL_TIME"],"experienceRequirements":["Mid-Level"],"industry":[["Cybersecurity"],["Data & Analytics"],["Digital Marketing"]],"jobBenefits":[["Flexible Work-Life Balance"],["Paid Parental Leave Options & Nearby Childcare Facilities"],["Tuition Reimbursement Program"],["On-site fitness & physical therapy"],["Competitive Salaries and Profit Sharing/Employee Stock Programs"],["Inclusive work culture and meaningful work from Day 1"],["Priority on Flexible Career Planning"]],"hiringOrganization":{"@type":["Organization"],"name":["The Procter & Gamble Company"],"sameAs":["http://pgcareers.com/informationtechnology"],"logo":["https://i.stack.imgur.com/ORm2C.jpg"],"description":["<p>At P&amp;G our developers work on a wide range of areas including big data, cybersecurity, machine learning, cloud native development, and more. As a P&amp;G developer, you will drive business value through the application of your technical mastery that delivers game-changing, technology-driven business models and capabilities while growing your skills. Visit <a href=\"https://www.pgcareers.com/informationtechnology\" rel=\"nofollow\">pgcareers.com/informationtechnology<\/a> today to learn more about how you can help us transform the way that P&amp;G does business!<\/p>\r\n<p><strong>Our Promise to you is Meaningful Work From Day 1<\/strong><\/p>\r\n<p>At P&amp;G, you&rsquo;ll be a leader from Day 1, building your enterprise skillset in a dynamic and ever-evolving environment so that you can develop into a world class leader and expert in your field. Our commitment to you is to have meaningful work contributes to the creation of billion-dollar brands, and a culture that is centered around coaching, developing, and mentoring you to offer fast-paced career progression.<\/p>\r\n<p><strong>Brands you know and love<\/strong><\/p>\r\n<p>We serve consumers around the world with one of the strongest portfolios of trusted, quality, leadership brands, including Always&reg;, Ariel&reg;, Bounty&reg;, Charmin&reg;, Crest&reg;, Dawn&reg;, Downy&reg;, Fairy&reg;, Febreze&reg;, Gain&reg;, Gillette&reg;, Head &amp; Shoulders&reg;, Lenor&reg;, Olay&reg;, Oral-B&reg;, Pampers&reg;, Pantene&reg;, SK-II&reg;, Tide&reg;, Vicks&reg;, and Whisper&reg;. The P&amp;G community includes operations in approximately 70 countries worldwide. Please visit http://www.pg.com/ for the latest news and information about P&amp;G and its brands.<br> <br> Our commitment is to provide branded products and services of superior quality and value that improve the lives of the world's consumers, now and for generations to come.<\/p>"]},"baseSalary":{"@type":["MonetaryAmount"],"currency":["USD"],"value":{"@type":["QuantitativeValue"],"minValue":[100000],"maxValue":[120000],"unitText":["YEAR"]}},"jobLocation":[{"@type":["Place"],"address":{"@type":["PostalAddress"],"addressCountry":["US"],"addressRegion":["OH"],"addressLocality":["Cincinnati"],"streetAddress":["1 Procter & Gamble Plaza"],"postalCode":["45202"]}}]}
